Белгипрозем_2017/src/Documents/ВедомостьАктирования/ВедомостьАктирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьАктирования</name>
  <registerRecords>AccumulationRegister.НачислениеЗП</registerRecords>
  <registerRecords>AccumulationRegister.УчетДоговоров</registerRecords>
  <registerRecords>AccumulationRegister.РасчетыСПокупателями</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Акты</name>
    <attributes>
      <name>Корреспондент</name>
      <type>
        <types>CatalogRef.Корреспонденты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАкта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаАкта</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Оплата</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>19</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Зарплата</name>
    <attributes>
      <name>Исполнитель</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>КТУ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Норматив</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>Коэффициент понижающий или повышающий</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>5</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбоснованиеКоэффициента</name>
      <type>
        <types>CatalogRef.ВнутренниеДокументы</types>
      </type>
    </attributes>
    <attributes>
      <name>Начислено</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтапДоговора</name>
      <type>
        <types>CatalogRef.мЭтапыДоговоров</types>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемРабот</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Белгипрозем_2017/src/Documents/ВедомостьАктирования/ManagerModule.bsl
// Инициализирует таблицы значений, содержащие данные документа.
// Таблицы значений сохраняет в свойствах структуры "ДополнительныеСвойства".
//
Процедура ИнициализироватьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Установил", Пользователи.ТекущийПользователь());
	Запрос.Текст ="ВЫБРАТЬ
                  | ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
                  | ВедомостьАктированияАкты.Корреспондент КАК Корреспондент,
                  | ВедомостьАктированияАкты.Договор КАК Договор,
                  | ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
                  | ВедомостьАктированияАкты.Подразделение,
 	              |	ВедомостьАктированияАкты.ЭтапДоговора.СтавкаНДС КАК СтавкаНДС,
	              |	ВедомостьАктированияАкты.ЭтапДоговора.ОсвобождениеОтНДС КАК ОсвобождениеОтНДС,
                  | ВедомостьАктированияАкты.ДатаАкта КАК Период,
                  | ВедомостьАктированияАкты.Сумма КАК Сумма,
                  | ВедомостьАктированияАкты.НДС КАК НДС,
                  | ВедомостьАктированияАкты.НомерАкта КАК НомерДокумента
                  |ИЗ
                  | Документ.ВедомостьАктирования.Акты КАК ВедомостьАктированияАкты
                  |ГДЕ
                  | ВедомостьАктированияАкты.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаВыполнения) КАК ВидДатыДоговора,
                  | ВедомостьАктированияАкты.Ссылка КАК Основание,
                  | ВедомостьАктированияАкты.Корреспондент КАК Корреспондент,
                  | ВедомостьАктированияАкты.Договор КАК Договор,
                  | ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
                  | ВедомостьАктированияАкты.ДатаАкта КАК Период,
				  | &Установил КАК Установил,
				  | ВедомостьАктированияАкты.ДатаАкта КАК Дата
                  |ИЗ
                  | Документ.ВедомостьАктирования.Акты КАК ВедомостьАктированияАкты
                  |ГДЕ
                  | ВедомостьАктированияАкты.Ссылка = &Ссылка
                  |;
                  |
                  |////////////////////////////////////////////////////////////////////////////////
                  |ВЫБРАТЬ
                  | ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
                  | ВедомостьАктированияЗарплата.Исполнитель,
                  | СУММА(ВедомостьАктированияЗарплата.Начислено) КАК Сумма,
                  | ВедомостьАктированияЗарплата.ЭтапДоговора,
                  | ВедомостьАктированияЗарплата.ЭтапДоговора.Подразделение КАК Подразделение,
                  | ВедомостьАктированияЗарплата.Ссылка.Дата КАК Период
                  |ИЗ
                  | Документ.ВедомостьАктирования.Зарплата КАК ВедомостьАктированияЗарплата
                  |ГДЕ
                  | ВедомостьАктированияЗарплата.Начислено <> 0
                  | И ВедомостьАктированияЗарплата.Ссылка = &Ссылка
                  |
                  |СГРУППИРОВАТЬ ПО
                  | ВедомостьАктированияЗарплата.ЭтапДоговора,
                  | ВедомостьАктированияЗарплата.ЭтапДоговора.Подразделение,
                  | ВедомостьАктированияЗарплата.Исполнитель,
                  | ВедомостьАктированияЗарплата.Ссылка.Дата";
				  //|;
				  //|
				  //|////////////////////////////////////////////////////////////////////////////////
				  //|ВЫБРАТЬ
				  //|	ЗНАЧЕНИЕ(Справочник.мВидыДатДоговоров.ДатаЗакрытия) КАК ВидДатыДоговора,
				  //|	ВедомостьАктированияАкты.Ссылка КАК Основание,
				  //|	ВедомостьАктированияАкты.Корреспондент КАК Корреспондент,
				  //|	ВедомостьАктированияАкты.Договор КАК Договор,
				  //|	ВедомостьАктированияАкты.ЭтапДоговора КАК ЭтапДоговора,
				  //|	ВедомостьАктированияАкты.ДатаАкта КАК Период,
				  //|	ВедомостьАктированияАкты.ДатаАкта КАК Дата
				  //|ИЗ
				  //|	Документ.ВедомостьАктирования.Акты КАК ВедомостьАктированияАкты
				  //|ГДЕ
				  //|	ВедомостьАктированияАкты.Ссылка = &Ссылка
				  //|	И ВедомостьАктированияАкты.Сумма = ВедомостьАктированияАкты.Оплата
				  //|	И ВедомостьАктированияАкты.Сумма = ВедомостьАктированияАкты.ЭтапДоговора.СтоимостьСНДС";
				  
	Результат = Запрос.ВыполнитьПакет();
  
	ТаблицыДляДвижений = ДополнительныеСвойства.ТаблицыДляДвижений;
	ТаблицыДляДвижений.Вставить("ТаблицаРасчетыСПокупателями", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаУчетДоговоров", Результат[0].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаДатыДоговоров", Результат[1].Выгрузить());
	ТаблицыДляДвижений.Вставить("ТаблицаНачислениеЗП", Результат[2].Выгрузить());
	//ТаблицыДляДвижений.Вставить("ТаблицаДатыЗакрытия", Результат[3].Выгрузить());
		
КонецПроцедуры // ИнициализироватьДанныеДокумента()
